Simulation/0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

kInlet          1.2869e-4;

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $kInlet;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    right
    {
        type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            kqRWallFunction;
        value           uniform 1e-7;
    }
}


// ************************************************************************* //
